lambda/src/test/resources/GuardianWeekly/CappedPriceIncrease/Subscription.json

{
  "success": true,
  "id": "id",
  "accountId": "accId",
  "accountNumber": "accNum",
  "accountName": "accName",
  "invoiceOwnerAccountId": "accId",
  "invoiceOwnerAccountNumber": "accNum",
  "invoiceOwnerAccountName": "accName",
  "subscriptionNumber": "subNum",
  "version": 12,
  "revision": "12.0",
  "termType": "TERMED",
  "invoiceSeparately": false,
  "contractEffectiveDate": "2002-02-12",
  "serviceActivationDate": "2002-02-12",
  "customerAcceptanceDate": "2016-04-22",
  "subscriptionStartDate": "2016-06-03",
  "subscriptionEndDate": "2023-05-26",
  "lastBookingDate": "2022-05-26",
  "termStartDate": "2022-05-26",
  "termEndDate": "2023-05-26",
  "initialTerm": 357,
  "initialTermPeriodType": "Day",
  "currentTerm": 12,
  "currentTermPeriodType": "Month",
  "autoRenew": true,
  "renewalSetting": "RENEW_WITH_SPECIFIC_TERM",
  "renewalTerm": 12,
  "renewalTermPeriodType": "Month",
  "contractedMrr": 10,
  "totalContractedValue": 840,
  "notes": null,
  "status": "Active",
  "TrialPeriodPrice__c": null,
  "CanadaHandDelivery__c": null,
  "QuoteNumber__QT": null,
  "GifteeIdentityId__c": null,
  "OpportunityName__QT": null,
  "GiftNotificationEmailDate__c": null,
  "Gift_Subscription__c": "No",
  "TrialPeriodDays__c": null,
  "CreatedRequestId__c": null,
  "AcquisitionSource__c": null,
  "CreatedByCSR__c": null,
  "CASSubscriberID__c": null,
  "LastPriceChangeDate__c": null,
  "InitialPromotionCode__c": "00912",
  "CpqBundleJsonId__QT": null,
  "RedemptionCode__c": null,
  "QuoteType__QT": null,
  "GiftRedemptionDate__c": null,
  "QuoteBusinessType__QT": null,
  "SupplierCode__c": null,
  "legacy_cat__c": null,
  "AcquisitionCase__c": null,
  "ReaderType__c": "Direct",
  "ActivationDate__c": null,
  "UserCancellationReason__c": null,
  "CorporateAccountId__c": null,
  "OpportunityCloseDate__QT": null,
  "IPaddress__c": null,
  "IPCountry__c": null,
  "PromotionCode__c": "A103L",
  "OriginalSubscriptionStartDate__c": null,
  "LegacyContractStartDate__c": null,
  "CancellationReason__c": null,
  "billToContact": null,
  "paymentTerm": null,
  "isLatestVersion": true,
  "cancelReason": null,
  "ratePlans": [
    {
      "id": "id",
      "lastChangeType": "Add",
      "productId": "2c92a0fd57d0a9870157d73fa27c3de1",
      "productName": "Guardian Weekly Zone A",
      "productSku": "ABC-00000017",
      "productRatePlanId": "2c92a0fd57d0a9870157d7412f19424f",
      "ratePlanName": "Guardian Weekly Quarterly",
      "ratePlanCharges": [
        {
          "id": "id",
          "originalChargeId": "2c92a0ff6300cc8a016301bd641c1bc1",
          "productRatePlanChargeId": "2c92a0ff57d0a0b50157d752a0077624",
          "number": "C-01294202",
          "name": "Zone A Quarterly",
          "type": "Recurring",
          "model": "FlatFee",
          "uom": null,
          "version": 5,
          "pricingSummary": "GBP30",
          "priceChangeOption": "UseLatestProductCatalogPricing",
          "priceIncreasePercentage": null,
          "currency": "GBP",
          "price": 30,
          "tiers": null,
          "chargeModelConfiguration": null,
          "inputArgumentId": null,
          "includedUnits": null,
          "overagePrice": null,
          "discountPercentage": null,
          "discountAmount": null,
          "applyDiscountTo": null,
          "discountLevel": null,
          "discountClass": null,
          "discountApplyDetails": null,
          "billingDay": "ChargeTriggerDay",
          "listPriceBase": "Per_Billing_Period",
          "billingPeriod": "Quarter",
          "specificBillingPeriod": null,
          "billingTiming": "IN_ADVANCE",
          "ratingGroup": null,
          "billingPeriodAlignment": "AlignToCharge",
          "quantity": 1,
          "smoothingModel": null,
          "numberOfPeriods": null,
          "overageCalculationOption": null,
          "overageUnusedUnitsCreditOption": null,
          "unusedUnitsCreditRates": null,
          "usageRecordRatingOption": null,
          "segment": 1,
          "effectiveStartDate": "2018-05-26",
          "effectiveEndDate": "2023-05-26",
          "processedThroughDate": "2022-08-26",
          "chargedThroughDate": "2022-11-26",
          "done": false,
          "triggerDate": null,
          "triggerEvent": "CustomerAcceptance",
          "endDateCondition": "Subscription_End",
          "upToPeriodsType": null,
          "upToPeriods": null,
          "specificEndDate": null,
          "mrr": 10,
          "dmrc": 0,
          "tcv": 600,
          "dtcv": 120,
          "originalOrderDate": "2018-04-26",
          "amendedByOrderOn": "2022-05-26",
          "description": "",
          "HolidayStart__c": null,
          "HolidayEnd__c": null,
          "ForceSync__c": null
        }
      ],
      "subscriptionProductFeatures": [],
      "externallyManagedPlanId": null
    },
    {
      "id": "id",
      "lastChangeType": "Remove",
      "productId": "2c92a0fd57d0a9870157d73fa27c3de1",
      "productName": "Guardian Weekly Zone A",
      "productSku": "ABC-00000017",
      "productRatePlanId": "2c92a0ff58bdf4eb0158f2ecc89c1034",
      "ratePlanName": "Guardian Weekly 1 Year",
      "ratePlanCharges": [
        {
          "id": "id",
          "originalChargeId": "2c92a0ff5ba41fe8015bab7af37f1425",
          "productRatePlanChargeId": "2c92a0ff58bdf4eb0158f2ecc8ae1036",
          "number": "C-00979540",
          "name": "Zone A 1 Year",
          "type": "Recurring",
          "model": "FlatFee",
          "uom": null,
          "version": 1,
          "pricingSummary": "GBP120",
          "priceChangeOption": "UseLatestProductCatalogPricing",
          "priceIncreasePercentage": null,
          "currency": "GBP",
          "price": 120,
          "tiers": null,
          "chargeModelConfiguration": null,
          "inputArgumentId": null,
          "includedUnits": null,
          "overagePrice": null,
          "discountPercentage": null,
          "discountAmount": null,
          "applyDiscountTo": null,
          "discountLevel": null,
          "discountClass": null,
          "discountApplyDetails": null,
          "billingDay": "ChargeTriggerDay",
          "listPriceBase": "Per_Billing_Period",
          "billingPeriod": "Annual",
          "specificBillingPeriod": null,
          "billingTiming": "IN_ADVANCE",
          "ratingGroup": null,
          "billingPeriodAlignment": "AlignToCharge",
          "quantity": 1,
          "smoothingModel": null,
          "numberOfPeriods": null,
          "overageCalculationOption": null,
          "overageUnusedUnitsCreditOption": null,
          "unusedUnitsCreditRates": null,
          "usageRecordRatingOption": null,
          "segment": 1,
          "effectiveStartDate": "2017-05-26",
          "effectiveEndDate": "2018-05-26",
          "processedThroughDate": "2018-05-26",
          "chargedThroughDate": "2018-05-26",
          "done": true,
          "triggerDate": null,
          "triggerEvent": "CustomerAcceptance",
          "endDateCondition": "Fixed_Period",
          "upToPeriodsType": "Billing_Periods",
          "upToPeriods": 1,
          "specificEndDate": null,
          "mrr": 10,
          "dmrc": 10,
          "tcv": 120,
          "dtcv": 120,
          "originalOrderDate": "2017-04-26",
          "amendedByOrderOn": null,
          "description": "",
          "HolidayStart__c": null,
          "HolidayEnd__c": null,
          "ForceSync__c": null
        }
      ],
      "subscriptionProductFeatures": [],
      "externallyManagedPlanId": null
    },
    {
      "id": "id",
      "lastChangeType": "Remove",
      "productId": "2c92a0fd57d0a9870157d73fa27c3de1",
      "productName": "Guardian Weekly Zone A",
      "productSku": "ABC-00000017",
      "productRatePlanId": "2c92a0ff58bdf4eb0158f2ecc89c1034",
      "ratePlanName": "Guardian Weekly 1 Year",
      "ratePlanCharges": [
        {
          "id": "id",
          "originalChargeId": "2c92a0ff5a840412015aaa76f8f353fc",
          "productRatePlanChargeId": "2c92a0ff58bdf4eb0158f2ecc8ae1036",
          "number": "C-00899555",
          "name": "Zone A 1 Year",
          "type": "Recurring",
          "model": "FlatFee",
          "uom": null,
          "version": 1,
          "pricingSummary": "GBP120",
          "priceChangeOption": "UseLatestProductCatalogPricing",
          "priceIncreasePercentage": null,
          "currency": "GBP",
          "price": 120,
          "tiers": null,
          "chargeModelConfiguration": null,
          "inputArgumentId": null,
          "includedUnits": null,
          "overagePrice": null,
          "discountPercentage": null,
          "discountAmount": null,
          "applyDiscountTo": null,
          "discountLevel": null,
          "discountClass": null,
          "discountApplyDetails": null,
          "billingDay": "ChargeTriggerDay",
          "listPriceBase": "Per_Billing_Period",
          "billingPeriod": "Annual",
          "specificBillingPeriod": null,
          "billingTiming": "IN_ADVANCE",
          "ratingGroup": null,
          "billingPeriodAlignment": "AlignToCharge",
          "quantity": 1,
          "smoothingModel": null,
          "numberOfPeriods": null,
          "overageCalculationOption": null,
          "overageUnusedUnitsCreditOption": null,
          "unusedUnitsCreditRates": null,
          "usageRecordRatingOption": null,
          "segment": 1,
          "effectiveStartDate": "2016-04-22",
          "effectiveEndDate": "2017-04-22",
          "processedThroughDate": "2017-04-22",
          "chargedThroughDate": "2017-04-22",
          "done": true,
          "triggerDate": null,
          "triggerEvent": "CustomerAcceptance",
          "endDateCondition": "Fixed_Period",
          "upToPeriodsType": "Billing_Periods",
          "upToPeriods": 1,
          "specificEndDate": null,
          "mrr": 10,
          "dmrc": 10,
          "tcv": 120,
          "dtcv": 120,
          "originalOrderDate": "2017-03-07",
          "amendedByOrderOn": null,
          "description": "Migrated sub",
          "HolidayStart__c": null,
          "HolidayEnd__c": null,
          "ForceSync__c": null
        }
      ],
      "subscriptionProductFeatures": [],
      "externallyManagedPlanId": null
    }
  ],
  "externallyManagedBy": null
}